{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.2,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.2,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-BINA_ADI",
    "2": "B-BINA_NO",
    "3": "B-BULVAR",
    "4": "B-CADDE",
    "5": "B-DAIRE_NO",
    "6": "B-IL",
    "7": "B-ILCE",
    "8": "B-KAT",
    "9": "B-MAHALLE",
    "10": "B-POSTA_KODU",
    "11": "B-SITE_ADI",
    "12": "B-SOKAK",
    "13": "B-TARIF",
    "14": "I-BINA_ADI",
    "15": "I-BINA_NO",
    "16": "I-BULVAR",
    "17": "I-CADDE",
    "18": "I-DAIRE_NO",
    "19": "I-KAT",
    "20": "I-MAHALLE",
    "21": "I-SITE_ADI",
    "22": "I-SOKAK",
    "23": "I-TARIF"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BINA_ADI": 1,
    "B-BINA_NO": 2,
    "B-BULVAR": 3,
    "B-CADDE": 4,
    "B-DAIRE_NO": 5,
    "B-IL": 6,
    "B-ILCE": 7,
    "B-KAT": 8,
    "B-MAHALLE": 9,
    "B-POSTA_KODU": 10,
    "B-SITE_ADI": 11,
    "B-SOKAK": 12,
    "B-TARIF": 13,
    "I-BINA_ADI": 14,
    "I-BINA_NO": 15,
    "I-BULVAR": 16,
    "I-CADDE": 17,
    "I-DAIRE_NO": 18,
    "I-KAT": 19,
    "I-MAHALLE": 20,
    "I-SITE_ADI": 21,
    "I-SOKAK": 22,
    "I-TARIF": 23,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
